
/// 資料結構處理
///https://blog.csdn.net/qq_39635239/article/details/96314771
///https://min.news/technique/3730028eec69171a09145298eb85ab0a.html
///https://news.gandi.net/zh-hant/2022/05/what-happens-when-you-enter-a-url-in-your-browser/


const newArray = () => {
  let arr1 = [
    [
      29,
      "桃園廠",
      69,
      "冷氣空調設備",
      63,
      "冷媒-R401b，R22/152a/124（61/11/28）"
    ],
    [
      29,
      "桃園廠",
      69,
      "冷氣空調設備",
      64,
      "冷媒-R410a，R32/125（50/50）"
    ],
    [
      29,
      "桃園廠",
      70,
      "飲水機",
      65,
      "冷媒-R413a，R134a/218/600a"
    ],
    [
      29,
      "桃園廠",
      72,
      "冰箱",
      67,
      "冷媒-R413a，R134a/218/600a"
    ],
    [
      29,
      "桃園廠",
      74,
      "滅火器",
      69,
      "冷媒-HFC-23/R-23，三氟甲烷，CHF3"
    ],
    [
      29,
      "桃園廠",
      76,
      "外購電力",
      71,
      "電力-電力"
    ],
    [
      29,
      "桃園廠",
      78,
      "公務車",
      81,
      "燃料油-車用汽油"
    ],
    [
      29,
      "桃園廠",
      79,
      "國內出差",
      73,
      "高鐵-新竹-嘉義"
    ],
    [
      29,
      "桃園廠",
      79,
      "國內出差",
      74,
      "長榮航空-航空器"
    ],
    [
      29,
      "桃園廠",
      79,
      "國內出差",
      75,
      "高鐵-板橋-嘉義"
    ],
    [
      29,
      "桃園廠",
      79,
      "國內出差",
      76,
      "高鐵-板橋-台南"
    ],
    [
      29,
      "桃園廠",
      80,
      "紙類",
      null,
      null
    ],
    [
      29,
      "桃園廠",
      81,
      "產品使用",
      null,
      null
    ],
    [
      29,
      "桃園廠",
      82,
      "化糞池",
      77,
      "化糞池-水肥"
    ],
    [
      29,
      "桃園廠",
      101,
      "用電上游",
      null,
      null
    ],
    [
      30,
      "台南廠",
      67,
      "發電機",
      60,
      "燃料油-柴油"
    ],
    [
      30,
      "台南廠",
      67,
      "發電機",
      82,
      "燃料油-柴油"
    ],
    [
      30,
      "台南廠",
      68,
      "冷氣空調設備",
      61,
      "冷媒-R401a，R22/152a/124（53/13/34）"
    ],
    [
      30,
      "台南廠",
      68,
      "冷氣空調設備",
      62,
      "冷媒-R410a，R32/125（50/50）"
    ],
    [
      30,
      "台南廠",
      71,
      "飲水機",
      66,
      "冷媒-R413a，R134a/218/600a"
    ],
    [
      30,
      "台南廠",
      73,
      "冰箱",
      68,
      "冷媒-R413a，R134a/218/600a"
    ],
    [
      30,
      "台南廠",
      75,
      "滅火器",
      70,
      "冷媒-HFC-23/R-23，三氟甲烷，CHF3"
    ],
    [
      30,
      "台南廠",
      77,
      "外購電力",
      72,
      "電力-電力"
    ]
  ]
  // const obj = Object.assign({}, arr1);
  let arrayTemp = arr1.map((item, i) => {
    console.log(item[0])
    return {
      id: item[0]
    }
  })
  console.log(arrayTemp)

}

const new1 = [
  {
    id: 30,
    name: '桃園場',
    children: [
      {
        id: 77,
        name: '外購電力',
        children: [
          {
            id: 72,
            name: '電力-電力',
          }
        ]
      }
    ]
  }
]

// 溫室系統的盤查，符合法規要求
// 遠端合作，文件、程式法清晰
// 使用者的回饋優化改善
// 前端和標需求可行度(評估成本、落地)
// vue 半外包半開發
// branch code review
// UI、UX 溝通
// 後端人力3人、
// 再找4 - 5人
// 後端開API討論 swwager 溝通
// 新專案為前後端分離
// MVC

// 三部分，遠端工作 第二階段(半外包，landing page 算薪資(一週 / 1萬))，第三階段(CEO)
// 可以使用 get 取代 post 機制嗎？
//url 送出
//碳盤查



// 直播類別
// 管理後台




newArray()
